Tekla Open API Reference for Tekla Structures 2025
RebarGuideline Class
 Defines a rebar guideline that is used in a RebarSet. A RebarSet has a minimum of one rebar guideline, the primary guideline.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.RebarGuideline
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class RebarGuideline
<SerializableAttribute>
Public NotInheritable Class RebarGuideline
The RebarGuideline type exposes the following members.
Constructors
Name | Description
RebarGuideline
 Initializes a new instance of the RebarGuideline class.
Top
Properties
Name | Description
ChamferType
 Gets or sets the chamfer type of the guideline. To create longitudinal bars on the top/bottom face of a flat polybeam, create a guideline at each corner, and use the ARC_POINT chamfer type at "curved" corners, and NONE otherwise.
Curve
 Gets or sets the geometric Contour of the rebar guideline.
FollowEdges
 Gets or sets a flag that indicates whether the guideline should attempt to follow the leg face edges located between its end points.
Id
 Gets or sets an identifier that may be used to identify instances of the same rebar guideline.
Spacing
 Gets or sets the RebarSpacing along the rebar guideline.
Top
See Also
Reference
Tekla.Structures.Model Namespace